{
  "main_project_1": {
    "overview": {
      "title": "OVERVIEW",
      "site":"https://eun1013.github.io/littlebliss/",
      "image_file": "/images/overview/images01.png",
      "sections": [
        {
          "subtitle": "프로젝트 목표",
          "content": "Little Bliss는 따뜻하고 부드러운 감성의 아기 의류를 선보이는 React 기반의 쇼핑몰 플랫폼입니다. 고객들이 사랑스러운 상품을 편안하게 탐색하고 구매할 수 있도록 모바일 중심의 반응형 UI/UX 디자인을 통해 최적화된 쇼핑 경험을 제공하는 것을 목표로 합니다."
        },
        {
          "subtitle": "UI 디자인 방식",
          "content": "Figma를 활용하여 Little Bliss만의 따뜻하고 감성적인 디자인 시스템을 구축하였습니다."
        },
        {
          "subtitle": "레이아웃 제작 방식",
          "content": "React 컴포넌트 기반으로 SCSS를 활용해 모듈화된 모바일 First 반응형 1단 레이아웃을 구현했으며, 다양한 기기에서 너비가 유연하게 조절되도록 최적화하여 시각적 일관성 및 사용자 접근성을 확보하였습니다."
        },
        {
          "subtitle": "내가 맡은 역할 (문서 담당)",
          "content": [
            "·  React와 SCSS를 활용해 Little Bliss의 전체 UI/UX를 개발, 모바일 및 데스크톱에 최적화된 모듈화된 1단 반응형 레이아웃으로 높은 사용자 접근성을 확보했습니다.",
            "·  상품 이미지 호버 인터랙션과 상세/리뷰/구매 정보 탭 전환 기능을 구현하여 효과적인 정보 탐색과 사용자 편의성을 높였습니다.",
            "·  최종적으로는 상품 옵션 선택, 가격 계산 로직 및 구매 버튼 UI를 개발하여 원활한 쇼핑 기능을 성공적으로 제공했습니다."
          ]
        }
      ]
    },
    "design_system": {
      "title": "DESIGN SYSTEM",
      "sections": [
        {
          "subtitle": "Color Styles",
          "colors": [
            "#FFBB55",
            "#C1DF91",
            "#F8EE52",
            "#666666",
            "#111111",
            "#FFFFFF"
          ],
          "description": "컬러 스타일은 따뜻하고 생동감 있는 주황색과 신선한 녹색 계열을 중심으로, 포인트가 되는 노란색과 다양한 그레이 톤이 조화롭게 사용되었습니다. 이를 통해 브랜드에 활력과 안정감을 동시에 부여하여 시각적인 균형을 이룹니다."
        },
        {
          "subtitle": "Font Styles",
          "fonts": [
            {
              "name": "Pretendard",
              "description": "선명한 가독성을 제공하는 프리텐다드(Pretendard)를 사용하여 사용자가 편안하게 정보를 접할 수 있도록 돕고, 효율적인 소통과 명확한 메시지 전달을 가능하게 합니다."
            } 
          ]
        }
      ]
    },
    "user_flow": {
      "title": "USER FLOW",
      "image_file": "/images/overview/user03.png",
      "description": "앱의 주요 사용 경로와 흐름을 시각적으로 나타낸 다이어그램"
    },
    "retrospective": {
      "title": "회고",
      "sections": [
        {
          "subtitle": "어려웠던 점",
          "content": ["지난 소담상점 프로젝트에서 아쉬웠던 부분들을 보완하고자 개인 프로젝트로 진행했지만, 욕심이 많았던 만큼 팀으로 나눠서 하던 작업을 혼자서 모두 처리하다 보니 시간이 꽤 오래 걸렸습니다.",
          " 여러 아이디어를 누군가와 상의하지 못하고 혼자 결정하다 보니 고민과 실행에 더 많은 시간이 필요했던 부분이 있었습니다."]
        },
        {
          "subtitle": "해결 방법",
          "content": ["혼자라는 어려움이 있었지만 꾸준히 노력한 끝에 문제를 해결할 수 있었습니다. 시간이 좀 걸리긴 했지만, 부족한 점을 보완하면서 한 단계 더 성장할 수 있었고,",
          " 스스로 깊이 고민하는 값진 시간과 함께 공부할 수 있는 좋은 기회가 되었습니다."]
        },
        {
          "subtitle": "리팩토링 포인트",
          "content": ["이미지 파일을 webp 포맷으로 변환 및 용량을 줄였음에도 불구하고, 이미지 수가 많아 로딩 속도가 느려지며 사용자 데이터 사용량이 증가하는 문제가 발생했습니다.",
          "문제를 해결하기 위해 이미지 최적화와 페이지 로딩 속도 개선이 필요하다는 점을 인지했고, 앞으로는 효율적인 이미지 관리와 최적화에 더욱 집중할 계획입니다."
      ]}
      ]
    }
  }
}
